betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_sdram.c
    /* Write last 16-bits if size is not 32-bits multiple */
    if ((BufferSize % 2U) != 0U)
    {
      *psdramaddress = ((uint32_t)(*psrcbuff) & 0x0000FFFFU) | ((*psdramaddress) & 0xFFFF0000U);
    }

    /* Update the SDRAM controller state */
    hsdram->State = DAL_SDRAM_STATE_READY;

    /* Process Unlocked */
    __DAL_UNLOCK(hsdram);
  }
  else
  {
    return DAL_ERROR;
  }

  return DAL_OK;
}

/**
  * @brief  Reads 32-bit data buffer from the SDRAM memory.
  * @param  hsdram pointer to a SDRAM_HandleTypeDef structure that contains
  *                the configuration information for SDRAM module.
  * @param  pAddress Pointer to read start address
  * @param  pDstBuffer Pointer to destination buffer
  * @param  BufferSize Size of the buffer to read from memory
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SDRAM_Read_32b(SDRAM_HandleTypeDef *hsdram, uint32_t *pAddress, uint32_t *pDstBuffer,
                                     uint32_t BufferSize)
{
  uint32_t size;
  __IO uint32_t *pSdramAddress = (uint32_t *)pAddress;
  uint32_t *pdestbuff = pDstBuffer;
  DAL_SDRAM_StateTypeDef state = hsdram->State;

  /* Check the SDRAM controller state */
  if (state == DAL_SDRAM_STATE_BUSY)
  {
    return DAL_BUSY;
  }
  else if (state == DAL_SDRAM_STATE_READY)
  {
    /* Process Locked */
    __DAL_LOCK(hsdram);

    /* Update the SDRAM controller state */
    hsdram->State = DAL_SDRAM_STATE_BUSY;

    /* Read data from source */
    for (size = BufferSize; size != 0U; size--)
    {
      *pdestbuff = *(__IO uint32_t *)pSdramAddress;
      pdestbuff++;
      pSdramAddress++;
    }

    /* Update the SDRAM controller state */
    hsdram->State = state;

    /* Process Unlocked */
    __DAL_UNLOCK(hsdram);
  }
  else
  {
    return DAL_ERROR;
  }

  return DAL_OK;
}

/**
  * @brief  Writes 32-bit data buffer to SDRAM memory.
  * @param  hsdram pointer to a SDRAM_HandleTypeDef structure that contains
  *                the configuration information for SDRAM module.
  * @param  pAddress Pointer to write start address
  * @param  pSrcBuffer Pointer to source buffer to write
  * @param  BufferSize Size of the buffer to write to memory
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SDRAM_Write_32b(SDRAM_HandleTypeDef *hsdram, uint32_t *pAddress, uint32_t *pSrcBuffer,
                                      uint32_t BufferSize)
{
  uint32_t size;
  __IO uint32_t *pSdramAddress = pAddress;
  uint32_t *psrcbuff = pSrcBuffer;

  /* Check the SDRAM controller state */
  if (hsdram->State == DAL_SDRAM_STATE_BUSY)
  {
    return DAL_BUSY;
  }
  else if (hsdram->State == DAL_SDRAM_STATE_READY)
  {
    /* Process Locked */
    __DAL_LOCK(hsdram);

    /* Update the SDRAM controller state */
    hsdram->State = DAL_SDRAM_STATE_BUSY;

    /* Write data to memory */
    for (size = BufferSize; size != 0U; size--)
    {
      *pSdramAddress = *psrcbuff;
      psrcbuff++;
      pSdramAddress++;
    }

    /* Update the SDRAM controller state */
    hsdram->State = DAL_SDRAM_STATE_READY;

    /* Process Unlocked */
    __DAL_UNLOCK(hsdram);
  }
  else
  {
    return DAL_ERROR;
  }

  return DAL_OK;
}

/**
  * @brief  Reads a Words data from the SDRAM memory using DMA transfer.
  * @param  hsdram pointer to a SDRAM_HandleTypeDef structure that contains
  *                the configuration information for SDRAM module.
  * @param  pAddress Pointer to read start address
  * @param  pDstBuffer Pointer to destination buffer
  * @param  BufferSize Size of the buffer to read from memory
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SDRAM_Read_DMA(SDRAM_HandleTypeDef *hsdram, uint32_t *pAddress, uint32_t *pDstBuffer,
                                     uint32_t BufferSize)
{
  DAL_StatusTypeDef status;
  DAL_SDRAM_StateTypeDef state = hsdram->State;

  /* Check the SDRAM controller state */
  if (state == DAL_SDRAM_STATE_BUSY)
  {
    status = DAL_BUSY;
  }
  else if (state == DAL_SDRAM_STATE_READY)
  {
    /* Process Locked */
    __DAL_LOCK(hsdram);

    /* Update the SDRAM controller state */
    hsdram->State = DAL_SDRAM_STATE_BUSY;

    /* Configure DMA user callbacks */
    if (state == DAL_SDRAM_STATE_READY)
    {
      hsdram->hdma->XferCpltCallback = SDRAM_DMACplt;
    }
    else
    {
      hsdram->hdma->XferCpltCallback = SDRAM_DMACpltProt;
    }
    hsdram->hdma->XferErrorCallback = SDRAM_DMAError;

    /* Enable the DMA Stream */
    status = DAL_DMA_Start_IT(hsdram->hdma, (uint32_t)pAddress, (uint32_t)pDstBuffer, (uint32_t)BufferSize);

    /* Process Unlocked */
    __DAL_UNLOCK(hsdram);
  }
  else
  {
    status = DAL_ERROR;
  }

  return status;
}

/**
  * @brief  Writes a Words data buffer to SDRAM memory using DMA transfer.
  * @param  hsdram pointer to a SDRAM_HandleTypeDef structure that contains
  *                the configuration information for SDRAM module.
  * @param  pAddress Pointer to write start address
  * @param  pSrcBuffer Pointer to source buffer to write
  * @param  BufferSize Size of the buffer to write to memory
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SDRAM_Write_DMA(SDRAM_HandleTypeDef *hsdram, uint32_t *pAddress, uint32_t *pSrcBuffer,
                                      uint32_t BufferSize)
{
  DAL_StatusTypeDef status;

  /* Check the SDRAM controller state */
  if (hsdram->State == DAL_SDRAM_STATE_BUSY)
  {
    status = DAL_BUSY;
  }
  else if (hsdram->State == DAL_SDRAM_STATE_READY)
  {
    /* Process Locked */
    __DAL_LOCK(hsdram);

    /* Update the SDRAM controller state */
    hsdram->State = DAL_SDRAM_STATE_BUSY;

    /* Configure DMA user callbacks */
    hsdram->hdma->XferCpltCallback = SDRAM_DMACplt;
    hsdram->hdma->XferErrorCallback = SDRAM_DMAError;

    /* Enable the DMA Stream */
    status = DAL_DMA_Start_IT(hsdram->hdma, (uint32_t)pSrcBuffer, (uint32_t)pAddress, (uint32_t)BufferSize);

    /* Process Unlocked */
    __DAL_UNLOCK(hsdram);
  }
  else
  {
    status = DAL_ERROR;
  }

  return status;
}

#if (USE_DAL_SDRAM_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User SDRAM Callback
  *         To be used instead of the weak (surcharged) predefined callback
  * @param hsdram : SDRAM handle
  * @param CallbackId : ID of the callback to be registered
  *        This parameter can be one of the following values:
  *          @arg @ref DAL_SDRAM_MSP_INIT_CB_ID       SDRAM MspInit callback ID
  *          @arg @ref DAL_SDRAM_MSP_DEINIT_CB_ID     SDRAM MspDeInit callback ID
  * @param pCallback : pointer to the Callback function
  * @retval status
  */
DAL_StatusTypeDef DAL_SDRAM_RegisterCallback(SDRAM_HandleTypeDef *hsdram, DAL_SDRAM_CallbackIDTypeDef CallbackId,
                                             pSDRAM_CallbackTypeDef pCallback)
{
  DAL_StatusTypeDef status = DAL_OK;
  DAL_SDRAM_StateTypeDef state;

  if (pCallback == NULL)
  {
    return DAL_ERROR;
  }

  /* Process locked */
  __DAL_LOCK(hsdram);

  state = hsdram->State;
  if (state == DAL_SDRAM_STATE_READY)
  {
    switch (CallbackId)
    {
      case DAL_SDRAM_MSP_INIT_CB_ID :
        hsdram->MspInitCallback = pCallback;
        break;
      case DAL_SDRAM_MSP_DEINIT_CB_ID :
        hsdram->MspDeInitCallback = pCallback;
        break;
      default :
        /* update return status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (hsdram->State == DAL_SDRAM_STATE_RESET)
  {
    switch (CallbackId)
    {
      case DAL_SDRAM_MSP_INIT_CB_ID :
        hsdram->MspInitCallback = pCallback;
        break;
      case DAL_SDRAM_MSP_DEINIT_CB_ID :
        hsdram->MspDeInitCallback = pCallback;
        break;
      default :
        /* update return status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* update return status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hsdram);
  return status;
}

/**
  * @brief  Unregister a User SDRAM Callback
  *         SDRAM Callback is redirected to the weak (surcharged) predefined callback
  * @param hsdram : SDRAM handle
  * @param CallbackId : ID of the callback to be unregistered
  *        This parameter can be one of the following values:
  *          @arg @ref DAL_SDRAM_MSP_INIT_CB_ID       SDRAM MspInit callback ID
  *          @arg @ref DAL_SDRAM_MSP_DEINIT_CB_ID     SDRAM MspDeInit callback ID
  *          @arg @ref DAL_SDRAM_DMA_XFER_CPLT_CB_ID  SDRAM DMA Xfer Complete callback ID
  *          @arg @ref DAL_SDRAM_DMA_XFER_ERR_CB_ID   SDRAM DMA Xfer Error callback ID
  * @retval status
  */
DAL_StatusTypeDef DAL_SDRAM_UnRegisterCallback(SDRAM_HandleTypeDef *hsdram, DAL_SDRAM_CallbackIDTypeDef CallbackId)
{
  DAL_StatusTypeDef status = DAL_OK;
  DAL_SDRAM_StateTypeDef state;

  /* Process locked */
  __DAL_LOCK(hsdram);

  state = hsdram->State;
  if (state == DAL_SDRAM_STATE_READY)
  {
    switch (CallbackId)
    {
      case DAL_SDRAM_MSP_INIT_CB_ID :
        hsdram->MspInitCallback = DAL_SDRAM_MspInit;
        break;
      case DAL_SDRAM_MSP_DEINIT_CB_ID :
        hsdram->MspDeInitCallback = DAL_SDRAM_MspDeInit;
        break;
      case DAL_SDRAM_DMA_XFER_CPLT_CB_ID :
        hsdram->DmaXferCpltCallback = DAL_SDRAM_DMA_XferCpltCallback;
        break;
      case DAL_SDRAM_DMA_XFER_ERR_CB_ID :
        hsdram->DmaXferErrorCallback = DAL_SDRAM_DMA_XferErrorCallback;
        break;
      default :
        /* update return status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (hsdram->State == DAL_SDRAM_STATE_RESET)
  {
    switch (CallbackId)
    {
      case DAL_SDRAM_MSP_INIT_CB_ID :
        hsdram->MspInitCallback = DAL_SDRAM_MspInit;
        break;
      case DAL_SDRAM_MSP_DEINIT_CB_ID :
        hsdram->MspDeInitCallback = DAL_SDRAM_MspDeInit;
        break;
      default :
        /* update return status */
        status = DAL_ERROR;
        break;
    }
  }
  else
  {
    /* update return status */
    status = DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hsdram);
  return status;
}

/**
  * @brief  Register a User SDRAM Callback for DMA transfers
  *         To be used instead of the weak (surcharged) predefined callback
  * @param hsdram : SDRAM handle
  * @param CallbackId : ID of the callback to be registered
  *        This parameter can be one of the following values:
  *          @arg @ref DAL_SDRAM_DMA_XFER_CPLT_CB_ID  SDRAM DMA Xfer Complete callback ID
  *          @arg @ref DAL_SDRAM_DMA_XFER_ERR_CB_ID   SDRAM DMA Xfer Error callback ID
  * @param pCallback : pointer to the Callback function
  * @retval status
  */
DAL_StatusTypeDef DAL_SDRAM_RegisterDmaCallback(SDRAM_HandleTypeDef *hsdram, DAL_SDRAM_CallbackIDTypeDef CallbackId,
                                                pSDRAM_DmaCallbackTypeDef pCallback)
{
  DAL_StatusTypeDef status = DAL_OK;
  DAL_SDRAM_StateTypeDef state;

  if (pCallback == NULL)
  {
    return DAL_ERROR;
  }

  /* Process locked */
  __DAL_LOCK(hsdram);

  state = hsdram->State;
  if (state == DAL_SDRAM_STATE_READY)
  {
    switch (CallbackId)
    {
      case DAL_SDRAM_DMA_XFER_CPLT_CB_ID :
        hsdram->DmaXferCpltCallback = pCallback;
        break;
      case DAL_SDRAM_DMA_XFER_ERR_CB_ID :
        hsdram->DmaXferErrorCallback = pCallback;
        break;
      default :
        /* update return status */
        status = DAL_ERROR;
        break;
    }
  }
  else
  {
    /* update return status */
    status = DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hsdram);
  return status;
}
#endif /* USE_DAL_SDRAM_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup SDRAM_Exported_Functions_Group3 Control functions
  *  @brief   management functions
  *
@verbatim
  ==============================================================================
                         ##### SDRAM Control functions #####
  ==============================================================================
  [..]
    This subsection provides a set of functions allowing to control dynamically
    the SDRAM interface.

@endverbatim
  * @{
  */

/**
  * @brief  Programs the SDRAM Memory Refresh period.
  * @param  hsdram pointer to a SDRAM_HandleTypeDef structure that contains
  *                the configuration information for SDRAM module.
  * @param  RefreshPeriod The SDRAM refresh period value
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SDRAM_ProgramRefreshPeriod(SDRAM_HandleTypeDef *hsdram, uint32_t RefreshPeriod)
{
  /* Check the SDRAM controller state */
  if (hsdram->State == DAL_SDRAM_STATE_BUSY)
  {
    return DAL_BUSY;
  }
  else if (hsdram->State == DAL_SDRAM_STATE_READY)
  {
    /* Update the SDRAM state */
    hsdram->State = DAL_SDRAM_STATE_BUSY;

    /* Program the refresh period */
    (void)DMC_SDRAM_ProgramRefreshPeriod(hsdram->Instance, RefreshPeriod);

