betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_sdram.c
    /* Update the SDRAM state */
    hsdram->State = DAL_SDRAM_STATE_READY;
  }
  else
  {
    return DAL_ERROR;
  }

  return DAL_OK;
}

/**
  * @brief  Sets the Number of consecutive SDRAM Memory open bank.
  * @param  hsdram pointer to a SDRAM_HandleTypeDef structure that contains
  *                the configuration information for SDRAM module.
  * @param  OpenBankNumber The SDRAM open bank number
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SDRAM_SetOpenBankNumber(SDRAM_HandleTypeDef *hsdram, uint32_t OpenBankNumber)
{
  /* Check the SDRAM controller state */
  if (hsdram->State == DAL_SDRAM_STATE_BUSY)
  {
    return DAL_BUSY;
  }
  else if (hsdram->State == DAL_SDRAM_STATE_READY)
  {
    /* Update the SDRAM state */
    hsdram->State = DAL_SDRAM_STATE_BUSY;

    /* Set the open bank number */
    (void)DMC_SDRAM_SetOpenBankNumber(hsdram->Instance, OpenBankNumber);

    /* Update the SDRAM state */
    hsdram->State = DAL_SDRAM_STATE_READY;
  }
  else
  {
    return DAL_ERROR;
  }

  return DAL_OK;
}

/**
  * @brief  Returns the SDRAM memory current mode.
  * @param  hsdram pointer to a SDRAM_HandleTypeDef structure that contains
  *                the configuration information for SDRAM module.
  * @retval The SDRAM memory mode.
  */
uint32_t DAL_SDRAM_GetModeStatus(SDRAM_HandleTypeDef *hsdram)
{
  /* Return the SDRAM memory current mode */
  return (DMC_SDRAM_GetModeStatus(hsdram->Instance));
}

/**
  * @}
  */

/** @defgroup SDRAM_Exported_Functions_Group4 State functions
  *  @brief   Peripheral State functions
  *
@verbatim
  ==============================================================================
                      ##### SDRAM State functions #####
  ==============================================================================
  [..]
    This subsection permits to get in run-time the status of the SDRAM controller
    and the data flow.

@endverbatim
  * @{
  */

/**
  * @brief  Returns the SDRAM state.
  * @param  hsdram pointer to a SDRAM_HandleTypeDef structure that contains
  *                the configuration information for SDRAM module.
  * @retval DAL state
  */
DAL_SDRAM_StateTypeDef DAL_SDRAM_GetState(SDRAM_HandleTypeDef *hsdram)
{
  return hsdram->State;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @brief  DMA SDRAM process complete callback.
  * @param  hdma : DMA handle
  * @retval None
  */
static void SDRAM_DMACplt(DMA_HandleTypeDef *hdma)
{
  SDRAM_HandleTypeDef *hsdram = (SDRAM_HandleTypeDef *)(hdma->Parent);

  /* Disable the DMA channel */
  __DAL_DMA_DISABLE(hdma);

  /* Update the SDRAM controller state */
  hsdram->State = DAL_SDRAM_STATE_READY;

#if (USE_DAL_SDRAM_REGISTER_CALLBACKS == 1)
  hsdram->DmaXferCpltCallback(hdma);
#else
  DAL_SDRAM_DMA_XferCpltCallback(hdma);
#endif /* USE_DAL_SDRAM_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA SRAM process complete callback.
  * @param  hdma : DMA handle
  * @retval None
  */
static void SDRAM_DMACpltProt(DMA_HandleTypeDef *hdma)
{
  SDRAM_HandleTypeDef *hsdram = (SDRAM_HandleTypeDef *)(hdma->Parent);

  /* Disable the DMA channel */
  __DAL_DMA_DISABLE(hdma);

  /* Update the SDRAM controller state */
  hsdram->State = DAL_SDRAM_STATE_WRITE_PROTECTED;

#if (USE_DAL_SDRAM_REGISTER_CALLBACKS == 1)
  hsdram->DmaXferCpltCallback(hdma);
#else
  DAL_SDRAM_DMA_XferCpltCallback(hdma);
#endif /* USE_DAL_SDRAM_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA SDRAM error callback.
  * @param  hdma : DMA handle
  * @retval None
  */
static void SDRAM_DMAError(DMA_HandleTypeDef *hdma)
{
  SDRAM_HandleTypeDef *hsdram = (SDRAM_HandleTypeDef *)(hdma->Parent);

  /* Disable the DMA channel */
  __DAL_DMA_DISABLE(hdma);

  /* Update the SDRAM controller state */
  hsdram->State = DAL_SDRAM_STATE_ERROR;

#if (USE_DAL_SDRAM_REGISTER_CALLBACKS == 1)
  hsdram->DmaXferErrorCallback(hdma);
#else
  DAL_SDRAM_DMA_XferErrorCallback(hdma);
#endif /* USE_DAL_SDRAM_REGISTER_CALLBACKS */
}

/**
  * @}
  */

#endif /* DAL_SDRAM_MODULE_ENABLED */

/**
  * @}
  */

#endif /* DMC */
